package ekp.mock;

public class MockData {

	
	public static String[][] materialNames = {
			{"M00A",	"料件00A		",	"EAC" },
			{"M00B",	"料件00B		",	"SPL" },
			{"M00C1",	"料件00C1		",	"SHE" },
			{"M00C3",	"料件00C3		",	"SHE" },
			{"M00D",	"料件00D		",	"MMT" },
			{"M00E",	"料件00E		",	"EAC" },
			{"M00F",	"料件00F		",	"CMK" },
			{"M00G",	"料件00G		",	"EAC" },
			
			{"M00Afa",	"料件00AFA	",	"EAC" },
			{"M00Beta",	"料件00Beta	",	"SPL" },
			{"M00Gamma","料件00Gamma	",	"SHE" },
			
			
//			{"M1101",	"互感線圈		",	"SPL" },
//			{"M1102",	"矽鋼片			",	"SHE" },
//			{"M1103",	"矽鋼片卷		",	"SPL" },
//			{"M1104",	"矽鋼帶			",	"SHE" },
//			{"M1105",	"矽鋼帶卷		",	"SPL" },
//			{"M1106",	"玻璃帶			",	"SHE" },
//			{"M1107",	"玻璃絕緣紙		",	"SHE" },
//			{"M1108",	"玻璃纖維紙		",	"SHE" },
//			{"M1109",	"玻璃纖維帶卷	",	"SPL" },
//			{"M1110",	"玻璃纖維絕緣帶	",	"SPL" },
//			{"M1111",	"紙紮絕緣片		",	"SHE" },
//			{"M1112",	"紙紮絕緣材料	",	"EAC" },
//			{"M1113",	"紙膠帶			",	"MMT" },
//			{"M1114",	"紙膠帶卷		",	"SPL" },
//			{"M1115",	"高溫絕緣紙		",	"MMT" },
//			{"M1116",	"乾式絕緣		",	"MMT" },
//			{"M1117",	"理石紙			",	"MMT" },
//			{"M1118",	"理石紙帶		",	"SPL" },
//			{"M1119",	"軟磁合金		",	"GRM" },
//			{"M1120",	"軟鐵線			",	"MMT" },
//			{"M1121",	"陶瓷絕緣體		",	"EAC" },
//			{"M1122",	"硬質紙板		",	"SHE" },
//			{"M1123",	"硬質纖維板		",	"SHE" },
//			{"M1124",	"硬質纖維帶		",	"SPL" },
//			{"M1125",	"紫銅導線		",	"SPL" },
//			{"M1126",	"絕緣漆			",	"GRM" },
//			{"M1127",	"黃銅線			",	"MMT" },
//			{"M1128",	"鈷合金磁芯		",	"EAC" },
//			{"M1129",	"鈷磁性材料		",	"EAC" },
//			{"M1130",	"鈷磁鐵			",	"GRM" },
//			{"M1131",	"鈷鐵矽合金		",	"GRM" },
//			{"M1132",	"鉛芯鉛線		",	"MMT" },
//			{"M1133",	"鉛導線			",	"MMT" },
//			{"M1134",	"電流互感線圈	",	"MMT" },
//			{"M1135",	"銅箔			",	"SHE" },
//			{"M1136",	"銅箔帶			",	"MMT" },
//			{"M1137",	"銅線螺線管		",	"SPL" },
//			{"M1138",	"熱熔帶			",	"SPL" },
//			{"M1139",	"熱熔漆			",	"GRM" },
//			{"M1140",	"熱熔膠			",	"GRM" },
//			{"M1141",	"熱熔纏繞帶		",	"SPL" },
//			{"M1142",	"鋁箔			",	"CMK" },
//			{"M1143",	"鋁線			",	"MMT" },
//			{"M1144",	"鋁線帶			",	"SPL" },
//			{"M1145",	"鋁導線			",	"MMT" },
//			{"M1146",	"導電漆			",	"GRM" },
//			{"M1147",	"導熱膏			",	"GRM" },
//			{"M1148",	"鎳鐵合金線		",	"MMT" },
//			{"M1149",	"鐵芯			",	"GRM" },
//			{"M1150",	"鐵芯板			",	"SHE" }
			
	};
	
	public static String[][] bizPartner = {
			{ "中科院", "45002910" }, //
			{ "台積電", "22099131" }, //
			{ "群光電子", "20954200" }, //
			{ "飛宏", "30435973" }, //
			{ "新鶴達貿易股份有限公司", "16863116" }, //
			{ "傑地有限公司", "12357481" }, //
	};
	
}
